
#დავალება1) შექმენით სია პროგრამირების ენების შესახებ, შეიტანეთ 5 პროგრამირების ენა. დაპრინტეთ  ჯერ მთლიანი სია, შემდეგ კი ბოლო ელემენტი.


Arr = ["javascript" , "python" , "java" , "lua" , "c++"]
print(Arr)
print(Arr[4])

#დავალება2) შექმენით სია, სადაც გექნებათ შეტანილი string, integer, float, boolean. საბოლოოდ ყველა ელემენტი ცალ-ცალკე გამოიტანეთ.


Arr1 = ["tazo" , 1 , 1.9 , True]
print(Arr1[0] , Arr1[1] , Arr1[2], Arr1[3] )

#დავალება3) შექმენით სია, სადაც გექნებათ 0-იდან 20-ის ჩათვლით 4-ის ჯერადები და პრინტით გამოიტანეთ უდიდესი.

Arr2 = []
for i in range(0,20):
    if i % 4 == 0:
     Arr2.append(i)
print(max(Arr2))

#დავალება4) შექმენით სია სადაც შეტანილი გექნებათ 30-იდან 50-ის ჩათვლით კენტი რიცხვები. შემდეგ დაპტინტეთ სამი უმცირესი ელემენტის ჯამი.

Arr3 = []
for i in range(30,50 + 1):
   if i % 2 == 1:
      Arr3.append(i)
print (Arr3[0] + Arr3[1] + Arr3[2])
#დავალება5) დაპრინტეთ სამის ჯერადები დავალება 4-ის სიიდან.
print (Arr3[0] , Arr3[1] , Arr3[2])

    
        